https://drive.google.com/file/d/1ZaNh_kZ5fIV7iXx350dDS2UbnSiJoRsD/view?usp=sharing

In [1]:
import pandas as pd

In [2]:
nba = pd.read_csv('nba.csv')

In [4]:
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

### Null Treatment
<hr>
1. Dropping Rows containing NaN using dropna()<br>

how = <all/any>
if all column value are null then ros will be deleted
any: any column is null or NaN

In [6]:
nba.shape

(458, 9)

In [7]:
nba.dropna(how='all', inplace = True)
nba.shape

(457, 9)

In [8]:
nba.dropna(how='any', inplace = True)
nba.shape

(364, 9)

#### Replacing NaN using FillNA method
<hr/>

In [9]:
nba= pd.read_csv('nba.csv')

In [10]:
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [13]:
nba['Salary'].fillna(0,inplace=True)

In [14]:
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,0.0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [15]:
nba['College'].fillna('No College', inplace=True)

In [16]:
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,0.0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,No College,5000000.0

In [19]:
nba.College.isnull()

0      False
1      False
2      False
3      False
4      False
       ...
453    False
454    False
455    False
456    False
457    False
Name: College, Length: 458, dtype: bool

### Data type corrections
<hr/>

In [25]:
employees = pd.read_csv('employees.csv')
employees.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

In [24]:
employees.dtypes

First Name            object
Gender                object
Start Date            object
Last Login Time       object
Salary                 int64
Bonus %              float64
Senior Management     object
Team                  object
dtype: object

employees = pd.read_csv('employees')

In [30]:
employees = pd.read_csv('employees.csv', parse_dates=[2,3])
employees.dtypes

First Name                   object
Gender                       object
Start Date           datetime64[ns]
Last Login Time      datetime64[ns]
Salary                        int64
Bonus %                     float64
Senior Management            object
Team                         object
dtype: object

In [31]:
employees['Senior Management'] = employees['Senior Management'].astype('bool')

In [33]:
employees.dtypes

First Name                   object
Gender                       object
Start Date           datetime64[ns]
Last Login Time      datetime64[ns]
Salary                        int64
Bonus %                     float64
Senior Management              bool
Team                         object
dtype: object

- df.to_numeric<br>
- df.to_data_times()<br>
https://pandas.pydata.org/docs/reference/api/pandas.to_numeric.html

In [44]:
mask = employees['Team'].isin(['Sales', 'Product'])  #multiple conditional filter to apply on 
employees[mask]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
6,Ruby,Female,1987-08-17,2022-03-26 16:20:00,65476,10.012,True,Product
13,Gary,Male,2008-01-27,2022-03-26 23:40:00,109831,5.831,False,Sales
15,Lillian,Female,2016-06-05,2022-03-26 06:09:00,59414,1.256,False,Product
17,Shawn,Male,1986-12-07,2022-03-26 19:45:00,111737,6.414,False,Product
19,Donna,Female,2010-07-22,2022-03-26 03:48:00,81014,1.894,False,Product
...,...,...,...,...,...,...,...,...
975,Susan,Female,1995-04-07,2022-03-26 22:05:00,92436,12.467,False,Sales
977,Sarah,Female,1995-12-04,2022-03-26 09:16:00,124566,5.949,False,Product
979,Ernest,Male,2013-07-20,2022-03-26 06:41:00,142935,13.198,True,Product
997,Russell,Male,2013-05-20,2022-03-26 12:39:00,96914,1.421,False,Product
999,Albert,Male,2012-05-15,2022-03-26 18:24:00,129949,10.169,True,Sales

In [38]:
 0 and 12

0

In [45]:
employees['Team'].value_counts()

Client Services         106
Finance                 102
Business Development    101
Marketing                98
Product                  95
Sales                    94
Engineering              92
Human Resources          91
Distribution             90
Legal                    88
Name: Team, dtype: int64

In [47]:
employees.Gender.value_counts(normalize=True)*100

Female    50.409357
Male      49.590643
Name: Gender, dtype: float64

### Dealing with Duplicates in Pandas
<hr/>

In [56]:
emp = pd.read_csv('employees.csv')

In [50]:
emp['First Name'].value_counts()

Marilyn    11
Barbara    10
Jeremy     10
Todd       10
Steven      9
           ..
Brian       1
Jean        1
Dennis      1
Angela      1
David       1
Name: First Name, Length: 200, dtype: int64

In [51]:
emp['First Name'].nunique()

200

In [55]:
#drop duplicate
emp.drop_duplicates(subset=['First Name'], keep='last', inplace=True)

-- keep = last means keep last record<br>
-- keep = first means keep first duplicate record<br>
-- Keep: False means delete all duplicate record

In [54]:
emp.shape

(201, 8)

In [58]:
emp.drop_duplicates(subset=['First Name'], keep=False, inplace=True)

In [59]:
emp.shape

(9, 8)

In [61]:
emp['First Name'].value_counts()

Dennis    1
Angela    1
Jean      1
Carol     1
Tammy     1
Eugene    1
Brian     1
Keith     1
David     1
Name: First Name, dtype: int64

In [62]:
bond = pd.read_csv('jamesbond.csv')

In [63]:
bond.head()

,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
1,From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
2,Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
3,Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7
4,Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [65]:
bond.set_index('Film', inplace=True)

In [67]:
bond.loc['Dr. No':'Thunderball']

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7

https://drive.google.com/file/d/1hBpuh0BaAV9vWWdsSlpqakRa9YryS9qj/view?usp=sharing

In [68]:
fortune = pd.read_csv('fortune1000.csv')

In [69]:
fortune.head()

,Rank,Company,Sector,Industry,Location,Revenue,Profits,Employees
0,1,Walmart,Retailing,General Merchandisers,"Bentonville, AR",482130,14694,2300000
1,2,Exxon Mobil,Energy,Petroleum Refining,"Irving, TX",246204,16150,75600
2,3,Apple,Technology,"Computers, Office Equipment","Cupertino, CA",233715,53394,110000
3,4,Berkshire Hathaway,Financials,Insurance: Property and Casualty (Stock),"Omaha, NE",210821,24083,331000
4,5,McKesson,Health Care,Wholesalers: Health Care,"San Francisco, CA",181241,1476,70400

In [71]:
fortune.shape

(1000, 8)

In [77]:
fortune['Sector'].nunique()

21

In [75]:
fortune['Sector'].value_counts()

Financials                      139
Energy                          122
Technology                      102
Retailing                        80
Health Care                      75
Business Services                51
Industrials                      46
Materials                        43
Food, Beverages & Tobacco        43
Wholesalers                      40
Transportation                   36
Chemicals                        30
Household Products               28
Engineering & Construction       26
Media                            25
Hotels, Resturants & Leisure     25
Motor Vehicles & Parts           24
Aerospace & Defense              20
Telecommunications               15
Apparel                          15
Food and Drug Stores             15
Name: Sector, dtype: int64

### Groupby

In [81]:
sectors = fortune.groupby('Sector')

In [83]:
type(sectors)#array of data frame

pandas.core.groupby.generic.DataFrameGroupBy

In [87]:
sectors.get_group('Aerospace & Defense')['Profits'].sum()

28742

In [85]:
sectors.get_group('Apparel').count

<bound method DataFrame.count of      Rank               Company   Sector Industry             Location  \
90     91                  Nike  Apparel  Apparel        Beaverton, OR
230   231                    VF  Apparel  Apparel       Greensboro, NC
339   340                   PVH  Apparel  Apparel         New York, NY
353   354          Ralph Lauren  Apparel  Apparel         New York, NY
447   448           Hanesbrands  Apparel  Apparel    Winston-Salem, NC
546   547          Levi Strauss  Apparel  Apparel    San Francisco, CA
574   575                 Coach  Apparel  Apparel         New York, NY
596   597          Under Armour  Apparel  Apparel        Baltimore, MD
682   683          Fossil Group  Apparel  Apparel       Richardson, TX
694   695       Skechers U.S.A.  Apparel  Apparel  Manhattan Beach, CA
725   726              Carter’s  Apparel  Apparel          Atlanta, GA
793   794  Wolverine World Wide  Apparel  Apparel         Rockford, MI
876   877   G-III Apparel Group  Apparel  Apparel         New York, NY
881   882   Columbia Sportswear  Apparel  Apparel         Portland, OR
916   917                 Guess  Apparel  Apparel      Los Angeles, CA

     Revenue  Profits  Employees
90     30601     3273      62600
230    12377     1232      64000
339     8020      572      26200
353     7620      702      20000
447     5732      429      65300
546     4495      209      12500
574     4192      402      12950
596     3963      233       9600
682     3229      221      15100
694     3159      232       6400
725     3014      238      16800
793     2692      123       6550
876     2344      114       8919
881     2326      174       5978
916     2204       82      13500  >

In [91]:
sectors.agg({'Revenue': ['sum', 'mean'], 'Profits':'sum', 'Employees':'sum'}) #key is the column, value is the operation

                              Revenue               Profits Employees
                                  sum          mean     sum       sum
Sector
Aerospace & Defense            357940  17897.000000   28742    968057
Apparel                         95968   6397.866667    8236    346397
Business Services              272195   5337.156863   28227   1361050
Chemicals                      243897   8129.900000   22628    463651
Energy                        1517809  12441.057377  -73447   1188927
Engineering & Construction     153983   5922.423077    5304    406708
Financials                    2217159  15950.784173  260209   3359948
Food and Drug Stores           483769  32251.266667   16759   1395398
Food, Beverages & Tobacco      555967  12929.465116   51417   1211632
Health Care                   1614707  21529.426667  106114   2678289
Hotels, Resturants & Leisure   169546   6781.840000   20697   2484245
Household Products             234737   8383.464286   14428    646038
Industrials                    497581  10816.978261   20764   1545229
Materials                      259145   6026.627907    4428    638123
Media                          220764   8830.560000   24347    550314
Motor Vehicles & Parts         482540  20105.833333   25898   1082560
Retailing                     1465076  18313.450000   47830   6227629
Technology                    1377600  13505.882353  180473   3578949
Telecommunications             461834  30788.933333   48637    832468
Transportation                 408508  11347.444444   44169   1536793
Wholesalers                    444800  11120.000000    8233    525597

In [2]:
rating = pd.read_csv('rating.csv')
rating.head()

      ID Department     Office  Rating
0  U2F26    Finance  New Delhi     3.4
1  U2M61  Marketing  New Delhi     3.9
2  U1S15      Sales  New Delhi     2.8
3  U1H87         HR     Mumbai     2.1
4  U1S51      Sales  New Delhi     4.6

In [3]:
rating['Training'] = rating.Rating.apply(lambda x: 'Yes' if x< 3.5 else 'No')

In [4]:
rating.head()

      ID Department     Office  Rating Training
0  U2F26    Finance  New Delhi     3.4      Yes
1  U2M61  Marketing  New Delhi     3.9       No
2  U1S15      Sales  New Delhi     2.8      Yes
3  U1H87         HR     Mumbai     2.1      Yes
4  U1S51      Sales  New Delhi     4.6       No

In [35]:
Departments = rating.groupby('Department' ).aggregate({'Training': [la]})

In [36]:
Departments.head()

                                                     Training
                                                          sum
Department
Finance     YesNoYesNoNoYesNoYesYesNoNoNoYesNoNoYesYesNoYe...
HR          YesNoNoNoNoYesYesYesNoNoNoNoYesNoNoYesNoYesNoN...
Marketing   NoNoYesYesYesNoNoNoYesNoYesYesNoNoYesNoNoYesYe...
Sales       YesNoNoNoNoYesNoNoNoNoYesYesNoYesNoYesNoYesNoN...

In [22]:
Departments.get_group('Marketing')['Training'].value_counts(normalize=True)*100

No     51.449275
Yes    48.550725
Name: Training, dtype: float64

In [23]:
Departments.get_group('Finance')['Training'].value_counts(normalize=True)*100

No     50.746269
Yes    49.253731
Name: Training, dtype: float64

In [24]:
Departments.get_group('HR')['Training'].value_counts(normalize=True)*100

No     61.068702
Yes    38.931298
Name: Training, dtype: float64

In [25]:
Departments.get_group('Sales')['Training'].value_counts(normalize=True)*100

No     53.076923
Yes    46.923077
Name: Training, dtype: float64

In [16]:
rating['Department'].nunique()

4

In [20]:
unique_dept = list(rating.drop_duplicates(subset='Department', keep='first')['Department'])

In [26]:
for i in unique_dept:
    print(i, len(rating[(rating['Training'] == 'No') & (rating['Department'] == i)]) / len(rating[rating['Department'] == i]) * 100)

Finance 50.74626865671642
Marketing 51.449275362318836
Sales 53.07692307692308
HR 61.06870229007634

In [37]:
import numpy as np
np_arr = np.array([[1, 5],
 [3, 7],
 [4, 9]])

In [39]:
np.reshape(np_arr, (1, -1))

array([[1, 5, 3, 7, 4, 9]])

In [40]:
np.reshape(np_arr, -1)

array([1, 5, 3, 7, 4, 9])

### Exercise

In [41]:
forest = pd.read_csv('forestfires.csv')

In [42]:
forest.head()

   X  Y month  day  FFMC   DMC     DC  ISI  temp  RH  wind  rain  area
0  7  5   mar  fri  86.2  26.2   94.3  5.1   8.2  51   6.7   0.0   0.0
1  7  4   oct  tue  90.6  35.4  669.1  6.7  18.0  33   0.9   0.0   0.0
2  7  4   oct  sat  90.6  43.7  686.9  6.7  14.6  33   1.3   0.0   0.0
3  8  6   mar  fri  91.7  33.3   77.5  9.0   8.3  97   4.0   0.2   0.0
4  8  6   mar  sun  89.3  51.3  102.2  9.6  11.4  99   1.8   0.0   0.0

In [57]:
forest_by_md = forest.groupby(['month','day']).mean()

In [47]:
def mean_wind_rain(x):
    wind = x['wind']
    rain = x['rain']
    return (wind+rain)/2

In [59]:
forest_by_md.loc[:,['wind', 'rain']]

               wind  rain
month day
apr   fri  3.100000   0.0
      mon  3.100000   0.0
      sat  4.500000   0.0
      sun  5.666667   0.0
      thu  5.800000   0.0
...             ...   ...
sep   sat  3.460000   0.0
      sun  3.955556   0.0
      thu  3.357143   0.0
      tue  3.431579   0.0
      wed  3.378571   0.0

[64 rows x 2 columns]